#include <stdio.h>

int main()
{
    int score_int = 90.5;
    printf("กรณีที่ 1 (int): score = %d\n", score_int);

    float score_float = 90.5f;
    printf("กรณีที่ 2 (float): score = %.1f\n", score_float);

    return 0;
}

//คำเตือน ต้องเลือกใช้ DATA TYPE ให้ถูกต้อง เพราะการเลือกใช้ Data Type ที่ไม่เหมาะสมจะช่วยให้โปรแกรมทำงานได้อย่างมีประสิทธิภาพและลดข้อผิดพลาดในการคำนวณ
/*สามารถ run ได้แม้ float scoer = 90.5; จะมีการแสดงผลเป็น 90.5 แต่ int score = 90.5; จะมีการแสดงผลเป็น 90 เนื่องจาก int ไม่สามารถเก็บค่าทศนิยมได้*/
//การใช้ int เหมาะสมกับการบันทึกที่เป็นจำนวนเต็มเท่านั้น ในขณะที่ float เหมาะสมกับการบันทึกค่าทศนิยม
//การใช้ float จะทำให้สามารถเก็บค่าทศนิยมได้อย่างถูกต้อง ในขณะที่การใช้ int จะทำให้ค่าทศนิยมถูกปัดเศษทิ้งไป




